Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "release test-git" in "/home/atlantis/.atlantis/repos/vipinable/tfmodule-tester/19/default": exit status 1: running "release test-git" in "/home/atlantis/.atlantis/repos/vipinable/tfmodule-tester/19/default": 
2022/09/03 11:01:43 analyze commits: object not found

Validate the changes.

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0100 12251  100    15  100 12236    151   120k --:--:-- --:--:-- --:--:--  122k
{"result":true}Validation sucess

Acquiring state lock. This may take a few moments...
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.imagebuilderEc2profilePolicy: Reading...
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.imagebuilderEc2profilePolicy: Read complete after 0s [id=1903849331]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
data.aws_caller_identity.current: Read complete after 1s [id=731685434595]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_role.imagebuilderProfileRole will be created
+ resource "aws_iam_role" "imagebuilderProfileRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam-role-app-imagebuilderProfileRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.EC2InstanceProfileForImageBuilder will be created
+ resource "aws_iam_role_policy_attachment" "EC2InstanceProfileForImageBuilder" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/EC2InstanceProfileForImageBuilder"
      + role       = "iam-role-app-imagebuilderProfileRole"
    }

  # aws_iam_service_linked_role.imagebuilderRole will be created
+ resource "aws_iam_service_linked_role" "imagebuilderRole" {
      + arn              = (known after apply)
      + aws_service_name = "imagebuilder.amazonaws.com"
      + create_date      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + tags_all         = (known after apply)
      + unique_id        = (known after apply)
    }

  # aws_imagebuilder_image_recipe.ImageBuilderRecipe will be created
+ resource "aws_imagebuilder_image_recipe" "ImageBuilderRecipe" {
      + arn              = (known after apply)
      + date_created     = (known after apply)
      + id               = (known after apply)
      + name             = "ImageBuilderRecipe"
      + owner            = (known after apply)
      + parent_image     = "arn:aws:imagebuilder:us-east-1:aws:image/amazon-linux-2-arm64/2022.1.25"
      + platform         = (known after apply)
      + tags_all         = (known after apply)
      + user_data_base64 = (known after apply)
      + version          = "1.0.0"

      + component {
          + component_arn = "arn:aws:imagebuilder:us-east-1:aws:component/amazon-cloudwatch-agent-linux/1.0.1/1"
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }
    }

  # null_resource.resource1[0] will be created
+ resource "null_resource" "resource1" {
      + id = (known after apply)
    }

  # null_resource.resource1[1] will be created
+ resource "null_resource" "resource1" {
      + id = (known after apply)
    }

  # null_resource.resource1[2] will be created
+ resource "null_resource" "resource1" {
      + id = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

release version v0.21.1

```
</details>

